#pragma once

/*******************************************************************************************************************************
*	$TC Tipo de dados: DEF Cor
*
*	$ED Descrição do tipo:
*		Representa uma cor de um jogador, peão ou oscar.
*******************************************************************************************************************************/
typedef enum {
	SEM_COR		= 0,
    AZUL		= 1,
    AMARELO		= 2,
    VERDE		= 3,
    VERMELHO	= 4
} DEF_tpCor;
 
/*******************************************************************************************************************************
*	$TC Tipo de dados: ITFC Booleano
*
*	$ED Descrição do tipo:
*		Representa um estado lógico: verdadeiro ou falso.
*******************************************************************************************************************************/
typedef enum {
    False,
	True
} DEF_tpBool;